---
kind: property
id: P:Autodesk.Revit.DB.TessellatedShapeBuilder.Fallback
source: html/59acf1d0-742a-45eb-df1c-edbb136279a4.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilder.Fallback Property

Defines acceptable fallback if the desired type of geometry can't be built.

## Syntax (C#)
```csharp
public TessellatedShapeBuilderFallback Fallback { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration